Revit 2027 API
PipeFittingAndAccessoryData.GetAllConnectorData Method
 Gets the connector data of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PipeFittingAndAccessoryConnectorData> GetAllConnectorData()
Public Function GetAllConnectorData As IList(Of PipeFittingAndAccessoryConnectorData)
public:
IList<PipeFittingAndAccessoryConnectorData^>^ GetAllConnectorData()
member GetAllConnectorData : unit -> IList<PipeFittingAndAccessoryConnectorData>
Return Value
IList<PipeFittingAndAccessoryConnectorData>
 All connector data.
Remarks
 PipeFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient. such as width, height, diameter and flow.
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace